[
    {
        "name": "Victor Hugo Market",
        "imageUrl": "",
        "address": {"coordinates": [93829435, 9383755]},
        "type": "Fresh Food market",
        "Description": "One of our favorite food markets in Europe is the Marché Victor Hugo in Toulouse. In addition to the usual fare (huge coils of local sausage, delicious breads, and decadent cakes), there is also a restaurant hall upstairs.  It seems that most locals while away a Sunday afternoon here lingering over a delicious three course menu (with wine of course!).",
        "opening_days": ["Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
        "opening_months": ["All year"],
        "opening_hours": {"from": 3, "to": 20},
        "website": "https://www.marche-victor-hugo.fr/"
    },
    {
        "name": "La Boqueria",
        "imageUrl": "",
        "address": {"coordinates": [74635522, 94848575]},
        "type": "Fresh Food market",
        "Description": "Located just off Las Ramblas, La Boqueria in Barcelona is a riot of colors and sound.  Fresh produce, juices, and sweets are of course on offer.  I remember also being jarred when I suddenly rounded a corner and stood face to face (literally) with a skinned goat's head.  You can find anything and everything in this large covered market hall.",
        "opening_days": ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"],
        "opening_months": ["December", "January", "February", "June", "July"],
        "opening_hours": {"from": 7, "to": 19},
        "website": "http://www.boqueria.barcelona/home"
    },
    {
        "name": "Jemaa el-Fna Square",
        "imageUrl": "",
        "location": {"coordinates": [9485755, 2654758]},
        "type": "Bazaar",
        "Description": "For a thousand years, Jemma el-Fna has served as a gathering place and market at the heart of Marrakesh. Fortune tellers, snake charmers, poets, and storytellers come to entertain the crowds, helping to create an intoxicating atmosphere whose cultural importance inspired UNESCO to create its Masterpieces of the Oral and Intangible Heritage of Humanity. Jemaa el-Fna is located in the medina quarter of Marrakesh. The square is open daily and things typically get going at around 8 a.m. and continue until at least midnight. Pickpockets are common, especially after dark. Also be prepared to see some questionable practices among the snake charmers and monkey trainers, who sometimes treat their animals in a less than ethical way. Be careful when takeing photos! Always aks if it's ok to avoid argueing with snake charmers, monkey trainers, singers..",
        "opening_days": "Every day",
        "opening_months": ["All year"],
        "opening_hours": {"from": 5, "to": 23},
        "website": "http://www.jemaaelfna.com"
    },
    {
        "name": "Union Square Greenmarket",
        "imageUrl": "",
        "location": {"coordinates": [84755655, 62635644]},
        "type": "Farmers market",
        "Description": "Once a Manhattan focal point, by the 1970s Union Square had become a junkie hangout. Barry Benepe founded a farmers market in 1976, aiding struggling Hudson Valley farmers and reintroducing New Yorkers to seasonal food in one stroke. The market's variety in this now revitalized area bewilders many supermarket shoppers.",
        "opening_days": ["Monday", "Wednesday", "Friday", "Saturday"],
        "opening_months": ["May", "June", "July", "August", "September"],
        "opening_hours": {"from": 10, "to": 17},
        "website": "https://www.facebook.com/UnionSquareGreenmarket/"
    },
    {
        "name": "Borough Market",
        "imageUrl": "",
        "location": {"coordinates": [95847363, 7262534]},
        "type": "Fresh Food market",
        "Description": "London's oldest food market—here for more than 250 years—is wholesale most of the week, but Thursdays through Saturdays it delights foodies with its cornucopia of fine foods from independent suppliers throughout the U.K. and beyond, from the choicest olive oils and cheeses to ostrich burgers and wild boar sausages.Planning: In good weather, take a picnic into the gardens of Southwark Cathedral, next to the market.",
        "opening_days": "Every day",
        "opening_months": ["All year"],
        "opening_hours": {"from": 9, "to": 15},
        "website": "https://boroughmarket.org.uk/"
    }
]